#include <iostream>
#include <cmath> // Для використання pow
using namespace std;

int main()
{
    // Оголошення змінних: x - вхідне значення, y - результат функції
    double x, y;

    // Введення значення x від користувача
    cout << "Введіть значення x: ";
    cin >> x;

    // Розрахунок значення функції
    y = 4 * pow(x - 3, 6) - 7 * pow(x - 3, 3) + 2;

    // Виведення результату
    cout << "Значення функції (y): " << y << endl;

    return 0; // Завершення програми
}
