#include <iostream>
#include <cmath> // Подключение библиотеки математических функций
using namespace std;

int main() {
    // Задание Integer2. Дана масса M в килограммах.
    // Определение количества полных тонн.
    cout << "Integer2. \n";
    int M, tons;
    cout << "Введите массу в килограммах M: ";
    cin >> M;
    tons = M / 1000; // Определение количества полных тонн (1 тонна = 1000 кг)
    cout << "Полных тонн в массе M: " << tons << "\n" << endl;

    // Задание Boolean30. Проверка, является ли треугольник равносторонним.
    cout << "Boolean30. \n";
    int a, b, c;
    cout << "Введите длины сторон треугольника a, b, c: ";
    cin >> a >> b >> c;
    bool is_equilateral = (a == b && b == c); // Проверка, равны ли все стороны
    cout << "Треугольник с длинами сторон " << a << ", " << b << ", " << c << " равносторонний: "
        << boolalpha << is_equilateral << "\n" << endl;

    // Задание Math 40 ( tab 3 *40 ). Вычислить математическое выражение для y.
    cout << "Math 40 ( tab 3 40 ) . \n";
    double x, y;
    cout << "Введите значение x: ";
    cin >> x;
    y = (2 * tan(x) * sin(x) + 1.0 / 4.0 * sqrt(1 - pow(sin(x), 2) * tan(x))) /
        (pow((1 + pow(x, 3) / 3 + 2 * log10(abs(x))), 4));
    cout << "Значение функции y = " << y << endl;

    return 0;
}
